In [1]:
import pandas as pd
import numpy as np

In [2]:
# Read Data:
salary_data=pd.read_csv(r'C:\Users\Admin\DataScienceProjects\SQL_Projects\HR-Job-Salary-Analysis-using-SQL-Power-BI\Data\web_scraped_data.csv')
salary_data.head()

,title,salary,location,employer,employer_rating,summary,search_city,search_role,country
0,Data Analyst,42500.0,London SW9 6DE•Temporarily Remote,Zen Educate,4.6,Perform ad-hoc data analysis.\r\nYou don't jus...,London,data analyst,UK
1,NaN,42948.0,London SE1 6LH,Arden and GEM Commissioning Support Unit,NaN,As an Information & data analyst the post hold...,London,data analyst,UK
2,Data Analyst,28508.0,London SE1 4YB,Guy's and St Thomas' NHS Foundation Trust,4.1,Maintainingdatabases and data collection syste...,London,data analyst,UK
3,Data Analyst,26760.0,London•Remote,Zymewire,NaN,Maintaining and updating our database of compa...,London,data analyst,UK
4,"Business Transformation Analyst, Consulting, F...",50106.5,London,Deloitte,4.0,"They include anything from programme managers,...",London,data analyst,UK

In [3]:
# Check for Shape:
salary_data.shape

(2141, 9)

In [4]:
salary_data.dtypes

title               object
salary             float64
location            object
employer            object
employer_rating     object
summary             object
search_city         object
search_role         object
country             object
dtype: object

In [5]:
# Check for Null values:
salary_data.isnull().sum()

title              252
salary               0
location             0
employer             1
employer_rating    867
summary              0
search_city          0
search_role          0
country              0
dtype: int64

In [6]:
# Replace title with Most occuring title and employer_rating with average average rating:
# Calculate the most common occurring title
most_common_title = salary_data['title'].mode()[0]

# Replace the null values in 'title' with the most common occurring title
salary_data['title'].fillna(most_common_title, inplace=True)

# Replace comma with dot in 'employer_rating' column
salary_data['employer_rating'] = salary_data['employer_rating'].str.replace(',', '.').astype(float)


# Calculate the average employee rating
average_rating = salary_data['employer_rating'].mean()

# Replace the null values in 'employer_rating' with the average rating
salary_data['employer_rating'].fillna(average_rating, inplace=True)

In [7]:
salary_data.isnull().sum()

title              0
salary             0
location           0
employer           1
employer_rating    0
summary            0
search_city        0
search_role        0
country            0
dtype: int64

In [8]:
# Drop rows with null values
salary_data = salary_data.dropna()

In [9]:
# Descriptive Analysis:
salary_data.describe()

              salary  employer_rating
count    2140.000000      2140.000000
mean    46439.740201         3.742151
std     32409.719105         0.465624
min        10.000000         1.000000
25%     30000.000000         3.700000
50%     42500.000000         3.742151
75%     59200.000000         3.900000
max    717600.000000         5.000000

In [10]:
# Save the Pre-processed Data for Analytical Dashboard:
salary_data.to_csv(r'C:\Users\Admin\DataScienceProjects\SQL_Projects\HR-Job-Salary-Analysis-using-SQL-Power-BI\Data\pre_processed_data.csv', index=False)